{
  "nav_home": "Accueil",
  "nav_projects": "Projets",
  "nav_experience": "Expérience",
  "nav_education": "Formation",
  "nav_about": "À propos",
  "nav_coverLetter": "Lettre de présentation",
  "nav_contact": "Contact",
  "nav_contact_me": "Me contacter",
  
  "hero_greeting": "Salut, je suis",
  "hero_button_projects": "Voir mes projets",
  "hero_button_contact": "Contact",
  "hero_phrases": {
    "1": "Étudiant et développeur junior",
    "2": "Passionné par React et JavaScript",
    "3": "Créateur d'expériences web"
  },

  "projects_title": "Projets",
  "project_view": "Voir →",
  "project_image_alt": "Image du projet",

  "experience_title": "Expérience professionnelle",
  "experience_job1_title": "Testeur de logiciels (Stage)",
  "experience_job1_company": "Croesus",
  "experience_job1_logo": "images/logoCroesus.png",
  "experience_job1_date": "Janv. 2024 - Mai 2024 · 5 mois",
  "experience_job1_desc": "Migration d'un environnement de test MBUnit utilisé par Gallio vers un environnement NUnit en transférant les tests de régression. Tâches principales : Migration des tests, planification des tests, résolution des comportements de tests différents entre les environnements, optimisation et déploiement des tests. Tout cela dans le but d'obtenir des gains de performance amplifiés dans un environnement en constante évolution.",

   "experience_job2_title": "Agent de Sécurité",
  "experience_job2_company": "IN4 Sécurité",
  "experience_job2_logo": "images/logoIN4.png",
  "experience_job2_date": "Janv. 2023 - Aujourd'hui",
  "experience_job2_desc": "Application rigoureuse des procédures de sécurité et maintien d'un environnement sûr. Tâches incluant la surveillance, la gestion des conflits et la prise de décision rapide en situation de stress, démontrant une grande autonomie et responsabilité.",

  "experience_job3_title": "Représentant du Service Clientèle",
  "experience_job3_company": "H&M",
  "experience_job3_logo": "images/imageLogoHM.png",
  "experience_job3_date": "Janv. 2022 - Août 2023 · 1 an 8 mois",
  "experience_job3_desc": "Fournir un service répondant aux besoins des clients, trier les vêtements, opérer la caisse enregistreuse, assurer l'arrivée de la marchandise et son organisation dans les rayons, trier les vêtements de la cabine d'essayage, répondre aux appels des clients et répondre à leurs besoins.",

  "experience_job4_title": "Employé du département des fruits et légumes",
  "experience_job4_company": "Maxi & Cie",
  "experience_job4_logo": "images/logoMaxi.png",
  "experience_job4_date": "Mai 2020 - Oct. 2020",
  "experience_job4_desc": "Assurer le bon fonctionnement de la section des fruits et légumes, incluant la réception et la vérification des produits, ce qui a développé des compétences en organisation et en précision.",

  "education_title": "Formation",
  "education_degree": "Techniques en informatique (DEC)", 
  "education_school": "Collège Montmorency", 
  "education_date": "2020 - 2024", 
  "education_desc": "Spécialisation en développement d'applications web et mobiles, couvrant un large éventail de technologies et de méthodologies de développement.",
  
   "about_title": "Plus qu'un simple développeur",
  "about_p1": "Passionné par le développement de logiciels et motivé par le désir constant d'apprendre de nouvelles technologies. J'apprécie particulièrement de prendre des rôles de leadership dans des projets d'équipe, en inspirant et en guidant mes collègues vers l'excellence. Je recherche actuellement un poste à temps partiel qui me permettra d'acquérir plus d'expérience, de relever de nouveaux défis et d'appliquer mes connaissances à des projets concrets.",
  "about_principles_title": "Mes principes",
  "about_principle1_title": "Apprentissage continu : ",
  "about_principle1_text": "Le monde du web évolue vite, et j'adore ça.",
  "about_principle2_title": "La collaboration avant tout : ",
  "about_principle2_text": "Les meilleures solutions naissent du travail d'équipe.",
  "about_principle3_title": "Rigueur et Dévouement : ",
  "about_principle3_text": "Je m'investis pleinement pour livrer un travail de qualité, propre et bien testé.",
  "about_principle4_title": "Leadership Collaboratif : ",
  "about_principle4_text": "J'aime prendre des initiatives et inspirer l'équipe pour atteindre nos objectifs communs.",
  "about_principle5_title": "Résolution de Problèmes : ",
  "about_principle5_text": "J'aborde chaque défi avec une mentalité analytique pour trouver des solutions créatives et efficaces.",

  "about_profile_alt": "Photo de profil de Yasser Manouzi",
  "about_name": "Yasser Manouzi",
  "about_job_title": "Développeur Front-end",
  "about_tech_title": "Technologies",
  

  "contact_title": "Contact",
  "contact_subtitle": "Envie de collaborer ? Envoyez-moi un message !",

  "project_page_back_to_projects": "Retour aux projets",
  "project_page_back": "Retour à l'accueil",
  "project_page_details_title": "Détails du projet",

  "cover_letter_content": "Madame, Monsieur,\n\nActuellement en pause d’études, je souhaite mettre à profit cette période pour approfondir mes compétences en informatique et acquérir davantage d’expérience professionnelle. Ayant déjà acquis une expérience pertinente dans ce domaine lors de mon passage au cégep, je désire maintenant développer mon savoir-faire dans un environnement de travail stimulant.\n\nAu cours de mes expériences académiques, j’ai eu l’occasion de participer à différents projets où j’ai pu appliquer mes connaissances en informatique, résoudre divers problèmes techniques et soutenir efficacement mes collègues. Ces expériences m’ont permis de développer de la rigueur, un bon sens de l’analyse ainsi qu’une réelle capacité d’adaptation face aux imprévus.\n\nSérieux, motivé et passionné par le domaine des technologies de l’information, je suis convaincu que mon profil répondra aux besoins de votre organisation. De plus, étant basé à Laval, je suis disponible et prêt à me déplacer facilement afin de répondre aux exigences du poste.\n\nJe suis persuadé que cette opportunité me permettra de contribuer positivement à vos projets tout en enrichissant mes compétences professionnelles. Je serais heureux de discuter de ma candidature lors d’une entrevue et de vous présenter plus en détail ma motivation.\n\nJe vous remercie de l’attention portée à ma candidature et reste à votre disposition pour toute information complémentaire.\n\nDans l’attente de votre retour, je vous prie d’agréer, Madame, Monsieur, l’expression de mes salutations distinguées.\n\nYasser Manouzi",

  "footer_text": "© 2025 Yasser. Tous droits réservés.",

  "project1_card_title": "Projet 1",
  "project1_page_title": "StageEtu - Application Mobile",
  "project1_description": "Application mobile pour la gestion des stages étudiants.",
  "project1_details": "L'application, codée en Kotlin, est conçue pour gérer les stages d'un étudiant. Ses fonctionnalités principales incluent des interfaces de connexion, d'inscription et de modification de profil. L'utilisateur peut accéder aux détails pertinents de son profil de stage directement depuis le menu d'accueil. L'application dispose d'une page de connexion, d'inscription, de modification de profil, et d'une page d'accueil pour un compte connecté. Une fois connecté, l'utilisateur peut rechercher des stages sur une page dédiée et consulter son accueil personnel avec toutes les informations importantes. L'application est toujours en cours de développement actif.",

  "project2_card_title": "Projet 2",
  "project2_page_title": "Jeu de Bataille Navale",
  "project2_description": "Jeu de bataille navale client/serveur en Java.",
  "project2_details": "L'application permet de générer des joueurs qui ont participé à une partie. Elle permet aussi de vérifier les statistiques de chaque joueur sélectionné, avec un menu pour accéder à la page des joueurs. Fonctionnalités : Ajout de joueurs, suppression de joueurs, et consultation des statistiques. Note : Les statistiques sont identiques pour chaque joueur et se mettent à jour à chaque ajout.",
  
  "project3_card_title": "Projet 3",
  "project3_page_title": "Application de Gestion Bancaire",
  "project3_description": "Application de gestion de comptes bancaires en Java.",
  "project3_details": "Une interface développée avec Swing qui permet la gestion de comptes bancaires avec des fonctionnalités telles que la connexion utilisateur, l'ajout de nouveaux comptes bancaires, et la réalisation de diverses opérations par l'utilisateur. Disponible en version console et interface graphique. ",

  "project4_card_title": "Projet 4",
  "project4_page_title": "Jeu de Dés en C#",
  "project4_description": "Un jeu développé en C# avec deux joueurs.",
  "project4_details": "Un jeu développé en C# qui implique la manipulation de dés avec deux joueurs. Les règles sont simples. Chaque joueur doit lancer le dé. Celui avec le nombre le plus élevé obtient un point. Un joueur gagne la partie lorsqu'il atteint 5 points."
}